In [1]:
import random

import pandas as pd
import numpy as np
import requests

## • read the JSON file that you saved in ex02

In [2]:
df = pd.read_json('../ex02/auto.json')
df

        CarNumber  Refund    Fines    Make    Model
0    Y163O8161RUS       2   3200.0    Ford    Focus
1     E432XX77RUS       1   6500.0  Toyota    Camry
2     7184TT36RUS       1   2100.0    Ford    Focus
3    X582HE161RUS       2   2000.0    Ford    Focus
4    92918M178RUS       1   5700.0    Ford    Focus
..            ...     ...      ...     ...      ...
720  Y163O8161RUS       2   1600.0    Ford    Focus
721  M0309X197RUS       1  22300.0    Ford    Focus
722  O673E8197RUS       2    600.0    Ford    Focus
723  8610T8154RUS       1   2000.0    Ford    Focus
724  H419XE197RUS       2   8594.6  Toyota  Corolla

[725 rows x 5 columns]

◦ one of the columns has the float type, so let us define the format of it in pandas using pd.options.display.float_format: floats should be displayed with two decimals
◦ there are values missing from the Model, do not do anything with them

In [3]:
pd.options.display.float_format = '{:.2f}'.format
df.count()

CarNumber    725
Refund       725
Fines        725
Make         725
Model        716
dtype: int64

## • enrich the dataframe using a sample from that dataframe

◦ create a sample with 200 new observations with random_state = 21
∗ the sample should not have new combinations of the car number, make and model, so the whole dataset will be consistent in these terms
∗ there are no restrictions on the refund and fines, you can take any value from these columns at random and use it towards any car number

In [4]:
res = df.sample(n=200, random_state=21)
res

        CarNumber  Refund    Fines        Make   Model
445  M0299X197RUS       2 19200.00        Ford   Focus
22   83298C154RUS       2  8594.60        Ford   Focus
93   H957HY161RUS       1  2000.00        Ford   Focus
173   T941CC96RUS       1  2000.00        Ford   Focus
697  H966HY161RUS       1   500.00        Ford   Focus
..            ...     ...      ...         ...     ...
14   8182XX154RUS       1   200.00        Ford   Focus
623   X796TH96RUS       1   500.00        Ford   Focus
498  T011MY163RUS       2  4000.00        Ford   Focus
536   T341CC96RUS       2  1000.00  Volkswagen  Passat
520   T119CT96RUS       1  2000.00        Ford   Focus

[200 rows x 5 columns]

◦ concatenate the sample with the initial dataframe to a new dataframe concat_rows

In [5]:
concat_rows = pd.concat([df, res])
concat_rows.count()

CarNumber    925
Refund       925
Fines        925
Make         925
Model        914
dtype: int64

## • enrich the dataframe concat_rows by a new column with the data generated

◦ create a series with the name Year using random integers from 1980 to 2019
◦ use np.random.seed(21) before generating the years
◦ concatenate the series with the dataframe and name it fines

In [6]:
np.random.seed(21)
year = pd.Series(np.random.randint(1980,2019, size=len(concat_rows))).rename('Year')
concat_rows.reset_index(inplace=True, drop=True)
fines = pd.concat([concat_rows, year], axis=1)
fines

        CarNumber  Refund   Fines        Make   Model  Year
0    Y163O8161RUS       2 3200.00        Ford   Focus  1989
1     E432XX77RUS       1 6500.00      Toyota   Camry  1995
2     7184TT36RUS       1 2100.00        Ford   Focus  1984
3    X582HE161RUS       2 2000.00        Ford   Focus  2015
4    92918M178RUS       1 5700.00        Ford   Focus  2014
..            ...     ...     ...         ...     ...   ...
920  8182XX154RUS       1  200.00        Ford   Focus  1996
921   X796TH96RUS       1  500.00        Ford   Focus  2002
922  T011MY163RUS       2 4000.00        Ford   Focus  1996
923   T341CC96RUS       2 1000.00  Volkswagen  Passat  2012
924   T119CT96RUS       1 2000.00        Ford   Focus  1984

[925 rows x 6 columns]

## • enrich the dataframe with the data from another dataframe
◦ create a new dataframe with the car numbers and their owners
∗ get the most popular surnames(you can find the file surname.json in
the attachments) in the US
∗ create a new series with the surnames (they should not have special characters like commas, brackets, etc.) from the data you gathered, the count should be equal to the number of unique car numbers using the sample
(use random_state = 21)
∗ create the dataframe owners with 2 columns: CarNumber and SURNAME

In [7]:
nn = pd.read_json('../data/surname.json')[0][1:]
car_num = pd.Series(fines['CarNumber'].unique()).rename('CarNumber')
nn = nn.sample(n=len(car_num), random_state=21, replace=True,ignore_index=True).rename('SURNAME')
owners = pd.concat([car_num, nn], axis=1)
owners

        CarNumber     SURNAME
0    Y163O8161RUS  RICHARDSON
1     E432XX77RUS        ROSS
2     7184TT36RUS      MORGAN
3    X582HE161RUS      BAILEY
4    92918M178RUS       LOPEZ
..            ...         ...
526  O136HO197RUS    CAMPBELL
527  O22097197RUS        HALL
528  M0309X197RUS       BAKER
529  O673E8197RUS        DIAZ
530  8610T8154RUS      MORGAN

[531 rows x 2 columns]

◦ append 5 more observations to the fines dataframe (come up with your own
ideas of CarNumber, etc.)

In [8]:
data = {'CarNumber': ['Y163O8000RUS', 'M103O8161RUS', 'Y163O8787RUS', 'Y163O0061RUS',                                'Y103O0161RUS'],
        'Refund': [2, 1, 1, 2, 1],
        'Fines': [344.00, 5454.00, 4345.00, 4343.00, 23324.00],
        'Make': ['Ford', 'Lada', 'Lada', 'Lada', 'Ford'],
        'Model': ['Focus', 'Kalina', 'Niva', 'Vesta', 'Mustang'],
        'Year': [1234, 1943, 1894, 2003, 2004]
        }
to_append = pd.DataFrame(data)
fines = pd.concat([fines, to_append], ignore_index=True)
fines

        CarNumber  Refund    Fines    Make    Model  Year
0    Y163O8161RUS       2  3200.00    Ford    Focus  1989
1     E432XX77RUS       1  6500.00  Toyota    Camry  1995
2     7184TT36RUS       1  2100.00    Ford    Focus  1984
3    X582HE161RUS       2  2000.00    Ford    Focus  2015
4    92918M178RUS       1  5700.00    Ford    Focus  2014
..            ...     ...      ...     ...      ...   ...
925  Y163O8000RUS       2   344.00    Ford    Focus  1234
926  M103O8161RUS       1  5454.00    Lada   Kalina  1943
927  Y163O8787RUS       1  4345.00    Lada     Niva  1894
928  Y163O0061RUS       2  4343.00    Lada    Vesta  2003
929  Y103O0161RUS       1 23324.00    Ford  Mustang  2004

[930 rows x 6 columns]

◦ delete the dataframe last 20 observations from the owners and add 3 new
observations (they are not the same as those you add to the fines dataframe)

In [9]:
owners.drop(owners.tail(20).index, inplace=True)
new_data = {'CarNumber': ['Y10000061RUS', 'M903O0161RUS', 'Y109O0154RUS'],
            'SURNAME': ['NOKIN', 'BOBROV', 'LUGOV']}
to_add = pd.DataFrame(new_data)
owners = pd.concat([owners, to_add], ignore_index=True)
owners

        CarNumber     SURNAME
0    Y163O8161RUS  RICHARDSON
1     E432XX77RUS        ROSS
2     7184TT36RUS      MORGAN
3    X582HE161RUS      BAILEY
4    92918M178RUS       LOPEZ
..            ...         ...
509  O50197197RUS      WRIGHT
510  7608EE777RUS        HILL
511  Y10000061RUS       NOKIN
512  M903O0161RUS      BOBROV
513  Y109O0154RUS       LUGOV

[514 rows x 2 columns]

◦ join both dataframes:
∗ the new dataframe should have only the car numbers that exist in both dataframes

In [10]:
inner = pd.merge(fines, owners, on='CarNumber')
inner

        CarNumber  Refund    Fines    Make    Model  Year     SURNAME
0    Y163O8161RUS       2  3200.00    Ford    Focus  1989  RICHARDSON
1    Y163O8161RUS       2  1600.00    Ford    Focus  1999  RICHARDSON
2     E432XX77RUS       1  6500.00  Toyota    Camry  1995        ROSS
3     E432XX77RUS       2 13000.00  Toyota    Camry  1992        ROSS
4     7184TT36RUS       1  2100.00    Ford    Focus  1984      MORGAN
..            ...     ...      ...     ...      ...   ...         ...
894  E41977152RUS       2  2400.00    Ford    Focus  2001       BAKER
895  9464EX178RUS       2  2100.00    Ford    Focus  1993      MARTIN
896  O50197197RUS       2  7800.00    Ford    Focus  1986      WRIGHT
897  7608EE777RUS       1  4000.00   Skoda  Octavia  2013        HILL
898  7608EE777RUS       1  4000.00   Skoda  Octavia  1987        HILL

[899 rows x 7 columns]

∗ the new dataframe should have all the car numbers that exist in both dataframes

In [11]:
outer = pd.merge(fines, owners, on='CarNumber', how='outer')
outer

        CarNumber  Refund    Fines    Make    Model    Year     SURNAME
0    Y163O8161RUS    2.00  3200.00    Ford    Focus 1989.00  RICHARDSON
1    Y163O8161RUS    2.00  1600.00    Ford    Focus 1999.00  RICHARDSON
2     E432XX77RUS    1.00  6500.00  Toyota    Camry 1995.00        ROSS
3     E432XX77RUS    2.00 13000.00  Toyota    Camry 1992.00        ROSS
4     7184TT36RUS    1.00  2100.00    Ford    Focus 1984.00      MORGAN
..            ...     ...      ...     ...      ...     ...         ...
928  Y163O0061RUS    2.00  4343.00    Lada    Vesta 2003.00         NaN
929  Y103O0161RUS    1.00 23324.00    Ford  Mustang 2004.00         NaN
930  Y10000061RUS     NaN      NaN     NaN      NaN     NaN       NOKIN
931  M903O0161RUS     NaN      NaN     NaN      NaN     NaN      BOBROV
932  Y109O0154RUS     NaN      NaN     NaN      NaN     NaN       LUGOV

[933 rows x 7 columns]

∗ the new dataframe should have only the car numbers from the fines dataframe

In [12]:
res_fines = pd.merge(fines, owners, on='CarNumber', how='left')
res_fines

        CarNumber  Refund    Fines    Make    Model  Year     SURNAME
0    Y163O8161RUS       2  3200.00    Ford    Focus  1989  RICHARDSON
1     E432XX77RUS       1  6500.00  Toyota    Camry  1995        ROSS
2     7184TT36RUS       1  2100.00    Ford    Focus  1984      MORGAN
3    X582HE161RUS       2  2000.00    Ford    Focus  2015      BAILEY
4    92918M178RUS       1  5700.00    Ford    Focus  2014       LOPEZ
..            ...     ...      ...     ...      ...   ...         ...
925  Y163O8000RUS       2   344.00    Ford    Focus  1234         NaN
926  M103O8161RUS       1  5454.00    Lada   Kalina  1943         NaN
927  Y163O8787RUS       1  4345.00    Lada     Niva  1894         NaN
928  Y163O0061RUS       2  4343.00    Lada    Vesta  2003         NaN
929  Y103O0161RUS       1 23324.00    Ford  Mustang  2004         NaN

[930 rows x 7 columns]

∗ the new dataframe should have only the car numbers from the owners dataframe

In [13]:
res_owners = pd.merge(fines, owners, on='CarNumber', how='right')
res_owners

        CarNumber  Refund    Fines    Make    Model    Year     SURNAME
0    Y163O8161RUS    2.00  3200.00    Ford    Focus 1989.00  RICHARDSON
1    Y163O8161RUS    2.00  1600.00    Ford    Focus 1999.00  RICHARDSON
2     E432XX77RUS    1.00  6500.00  Toyota    Camry 1995.00        ROSS
3     E432XX77RUS    2.00 13000.00  Toyota    Camry 1992.00        ROSS
4     7184TT36RUS    1.00  2100.00    Ford    Focus 1984.00      MORGAN
..            ...     ...      ...     ...      ...     ...         ...
897  7608EE777RUS    1.00  4000.00   Skoda  Octavia 2013.00        HILL
898  7608EE777RUS    1.00  4000.00   Skoda  Octavia 1987.00        HILL
899  Y10000061RUS     NaN      NaN     NaN      NaN     NaN       NOKIN
900  M903O0161RUS     NaN      NaN     NaN      NaN     NaN      BOBROV
901  Y109O0154RUS     NaN      NaN     NaN      NaN     NaN       LUGOV

[902 rows x 7 columns]

## • create a pivot table from the fines dataframe

In [14]:
pd.pivot_table(fines,
               index=["Make", "Model"],
               columns=["Year"],
               values=["Fines"],
               aggfunc={"Fines":np.sum})

                    Fines                                               \
Year                 1234    1894    1943     1980      1981      1982
Make       Model
Ford       Focus   344.00     NaN     NaN 89194.60 266783.80 107283.80
           Mondeo     NaN     NaN     NaN      NaN       NaN  46200.00
           Mustang    NaN     NaN     NaN      NaN       NaN       NaN
Lada       Kalina     NaN     NaN 5454.00      NaN       NaN       NaN
           Niva       NaN 4345.00     NaN      NaN       NaN       NaN
           Vesta      NaN     NaN     NaN      NaN       NaN       NaN
Skoda      Octavia    NaN     NaN     NaN 13794.60   1900.00   8894.60
Toyota     Camry      NaN     NaN     NaN 12000.00       NaN   1000.00
           Corolla    NaN     NaN     NaN      NaN   6800.00       NaN
Volkswagen Golf       NaN     NaN     NaN 20800.00   8594.60   5000.00
           Jetta      NaN     NaN     NaN      NaN   1000.00       NaN
           Passat     NaN     NaN     NaN   900.00  12500.00       NaN
           Touareg    NaN     NaN     NaN      NaN       NaN       NaN

                                                           ...            \
Year                    1983      1984      1985     1986  ...      2009
Make       Model                                           ...
Ford       Focus   147289.20 106000.00 307494.60 69700.00  ... 159894.60
           Mondeo        NaN       NaN       NaN      NaN  ...       NaN
           Mustang       NaN       NaN       NaN      NaN  ...       NaN
Lada       Kalina        NaN       NaN       NaN      NaN  ...       NaN
           Niva          NaN       NaN       NaN      NaN  ...       NaN
           Vesta         NaN       NaN       NaN      NaN  ...       NaN
Skoda      Octavia       NaN   1300.00 153594.60      NaN  ...       NaN
Toyota     Camry     8594.60   1000.00       NaN 19800.00  ...       NaN
           Corolla  12800.00       NaN   4400.00      NaN  ...   8594.60
Volkswagen Golf       200.00       NaN 168000.00      NaN  ...       NaN
           Jetta         NaN       NaN   9000.00      NaN  ...       NaN
           Passat    1100.00   8594.60       NaN 16000.00  ...   3200.00
           Touareg       NaN       NaN       NaN      NaN  ...   5800.00

                                                                              \
Year                   2010      2011      2012      2013     2014      2015
Make       Model
Ford       Focus   96000.00 117194.60 152989.20 297378.40 90378.40 172700.00
           Mondeo       NaN       NaN       NaN  41100.00      NaN       NaN
           Mustang      NaN       NaN       NaN       NaN      NaN       NaN
Lada       Kalina       NaN       NaN       NaN       NaN      NaN       NaN
           Niva         NaN       NaN       NaN       NaN      NaN       NaN
           Vesta        NaN       NaN       NaN       NaN      NaN       NaN
Skoda      Octavia  3000.00   3000.00   1700.00  11800.00 18900.00  16394.60
Toyota     Camry   22400.00       NaN   7500.00       NaN      NaN       NaN
           Corolla  6000.00   3400.00       NaN       NaN      NaN  30300.00
Volkswagen Golf         NaN       NaN       NaN       NaN 13900.00   4600.00
           Jetta        NaN       NaN       NaN       NaN      NaN       NaN
           Passat   9500.00       NaN   1000.00   1600.00 15000.00       NaN
           Touareg      NaN       NaN       NaN       NaN      NaN       NaN


Year                    2016      2017      2018
Make       Model
Ford       Focus   110789.20 114089.20 107800.00
           Mondeo        NaN   8600.00       NaN
           Mustang       NaN       NaN       NaN
Lada       Kalina        NaN       NaN       NaN
           Niva          NaN       NaN       NaN
           Vesta         NaN       NaN       NaN
Skoda      Octavia  35700.00   2400.00 153200.00
Toyota     Camry      800.00       NaN       NaN
           Corolla       NaN   6900.00       NaN
Volkswagen Golf          NaN       NaN   1000.00
           Jetta         NaN       NaN       NaN
           Passat        NaN       NaN       NaN
           Touareg       NaN       NaN       NaN

[13 rows x 42 columns]

## • save both the fines and owners dataframes to CSV files without an index

In [15]:
fines.to_csv("fines.csv", index=False)
owners.to_csv("owners.csv", index=False)